#Дан файл f, компоненти якого є цілими числами. Знайти кількість парних та
#кількість двозначних чисел серед компонентів файлу. Результат вивести на екран.
#Павлюк Владислав
print('Исходный файл:')
f=open('fg.txt', 'r')
print(f.read())
f=open('fg.txt', 'r')
count1=0
count=0
for i in f:#Пройдемся по строкам файла
   number=int(i)#Сделаем строку целым числом
   if number%2==0:
       count1+=1
   if number>9 and number<100:
       count+=1
print("Количество парных чисел",count1)
print("Количество двухзначных чисел",count)
